# ElementCategoryFilter Constructor (ElementId, Boolean)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementCategoryFilter Constructor (ElementId, Boolean)
ElementCategoryFilter Class See Also
---
Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementCategoryFilter(
	ElementId categoryId,
	bool inverted
)
```

Visual Basic
---
```text
Public Sub New ( _
	categoryId As ElementId, _
	inverted As Boolean _
)
```

Visual C++
---
```text
public:
ElementCategoryFilter(
	ElementId^ categoryId,
	bool inverted
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The category id to match.
inverted
    Type: System..::..Boolean True if the filter should match all elements which are not of the given category.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The category was not valid for filtering. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementCategoryFilter Class
ElementCategoryFilter Overload
Autodesk.Revit.DB Namespace